Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 227, 227, 64)      1792      
_________________________________________________________________
batch_normalization (BatchNo (None, 227, 227, 64)      256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 227, 227, 64)      36928     
_________________________________________________________________
batch_normalization_1 (Batch (None, 227, 227, 64)      256       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 113, 113, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 113, 113, 128)     73856     
_________________________________________________________________
batch_normalization_2 (Batch (None, 113, 113, 128)     512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 113, 113, 128)     147584    
_________________________________________________________________
batch_normalization_3 (Batch (None, 113, 113, 128)     512       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 401408)            0         
_________________________________________________________________
dense (Dense)                (None, 4)                 1605636   
=================================================================
Total params: 1,867,332
Trainable params: 1,866,564
Non-trainable params: 768
_________________________________________________________________
