Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 227, 227, 8)       224       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 113, 113, 8)       0         
_________________________________________________________________
batch_normalization (BatchNo (None, 113, 113, 8)       32        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 113, 113, 16)      1168      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 16)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 56, 56, 16)        64        
_________________________________________________________________
flatten (Flatten)            (None, 50176)             0         
_________________________________________________________________
dense (Dense)                (None, 4)                 200708    
=================================================================
Total params: 202,196
Trainable params: 202,148
Non-trainable params: 48
_________________________________________________________________
